---
kind: property
id: P:Autodesk.Revit.DB.SolidCurveIntersectionOptions.ResultType
source: html/764cf73f-58d1-ee8e-188b-f27cdbfc7c32.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionOptions.ResultType Property

The type of results expected by the calculation. The default is CurveSegmentsInside.

## Syntax (C#)
```csharp
public SolidCurveIntersectionMode ResultType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration